{
    "categories": [
        {"id": 1, "name": "Projects"},
        {"id": 2, "name": "Stories"},
        {"id": 3, "name": "Updates"}
    ],
    "blogs": [
        {
            "id": 1,
            "title": "Making a Difference: Our Latest Water Project",
            "date": "2024-02-15",
            "author": "John Smith",
            "image": "blog1.jpg",
            "category_id": 1,
            "tags": ["water", "community", "development"],
            "excerpt": "Learn about how our recent water project is transforming lives in rural communities.",
            "content": "<h1>Providing Clean Water: A Step Toward Better Health</h1><p>Water scarcity remains a pressing issue in many parts of Bangladesh. In January 2024, Smiling Foundation launched an initiative to provide clean drinking water to villages suffering from unsafe water sources.</p><p>We installed 20 tube wells across five remote villages, ensuring thousands of people now have access to safe drinking water. This project not only improves health but also reduces the burden on women and children who previously had to walk miles to fetch water.</p><p>Community involvement was crucial in making this project successful. Local volunteers and donors played a vital role in funding and executing the installations.</p><p>Our next goal is to expand this initiative to more districts in need. Join us in our mission to provide safe water for everyone.</p>",
            "comments": [
                {
                    "id": 1,
                    "name": "Jane Doe",
                    "date": "2024-02-16",
                    "comment": "This is amazing work! Keep it up!"
                }
            ]
        },
        {
            "id": 2,
            "title": "Education Initiative Success Stories",
            "date": "2024-02-01",
            "author": "Jane Doe",
            "image": "blog2.jpg",
            "category_id": 3,
            "tags": ["education", "success", "youth"],
            "excerpt": "See how our education programs are creating opportunities for underprivileged children.",
            "content": "<h1>Breaking Barriers: Education for Every Child</h1><p>Education is a powerful tool for change, yet millions of children in Bangladesh lack access to quality learning opportunities.</p><p>Our ‘Education for All’ program has successfully enrolled over 500 children in primary schools across rural areas. We provide school supplies, uniforms, and meals to ensure that financial constraints do not hinder their education.</p><p>Meet Rina, a 10-year-old girl from a small village in Rangpur. Before joining our program, she had never attended school. Today, she excels in her studies and dreams of becoming a doctor.</p><p>Through continued support, we aim to reach thousands more children. Your contribution can help shape a brighter future for them.</p>",
            "comments": []
        },
        {
            "id": 1,
            "title": "Emergency Relief: Helping Cyclone Victims",
            "date": "2024-02-05",
            "author": "Rahman Ali",
            "image": "blog3.jpg",
            "category_id": 4,
            "tags": ["disaster relief", "cyclone", "support"],
            "excerpt": "After a devastating cyclone, we provided aid to affected families.",
            "content": "<h1>Rebuilding Lives After the Storm</h1><p>In December 2023, Cyclone Amphan struck the coastal regions of Bangladesh, leaving thousands homeless. Smiling Foundation responded immediately with emergency relief efforts.</p><p>We distributed food, medicine, and clean water to over 2,000 affected families. Additionally, temporary shelters were built to provide safety and comfort to those who lost their homes.</p><p>Our volunteers worked tirelessly to support communities during this difficult time. We are now focusing on long-term rehabilitation, including rebuilding homes and providing livelihood support.</p><p>Your donations can help families recover and rebuild their lives.</p>",
            "comments": []
        },
        {
            "id": 2,
            "title": "Empowering Women Through Skill Development",
            "date": "2024-01-25",
            "author": "Fatima Begum",
            "image": "blog4.jpg",
            "category_id": 1,
            "tags": ["women empowerment", "skills", "employment"],
            "excerpt": "We are helping women gain financial independence through skill-based training programs.",
            "content": "<h1>Creating Opportunities for Women</h1><p>Financial independence is a key factor in empowering women. To support this, we launched a skill development program that trains women in sewing, handicrafts, and digital literacy.</p><p>Over 300 women have completed our training and are now earning by selling handmade products or working in local businesses.</p><p>One success story is Ayesha, a mother of two who was struggling to make ends meet. After completing our sewing course, she started her own tailoring business and now supports her family independently.</p><p>We aim to expand our program to reach more women in need. Your support can make a difference.</p>",
            "comments": []
        }
    ]
}
